#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>

//int main()  // 按位与 - 只要有0结果为0
//{
//	int a = 3;
//	// 00000000000000000000000000000011
//	int b = 5;
//	// 00000000000000000000000000000101
//
//	int c = a & b;
//	// 00000000000000000000000000000001 - 结果为1
//
//	printf("%d\n", c);
//	return 0;
//}

//int main()  // 按位或 - 只要有1结果为1
//{
//	int a = 3;
//	// 00000000000000000000000000000011
//	int b = 5;
//	// 00000000000000000000000000000101
//
//	int c = a | b;
//	// 00000000000000000000000000000111 - 结果为7
//
//	printf("%d\n", c);
//	return 0;
//}

//int main()  // 按位异或 - 相同为0相异为1
//{
//	int a = 3;
//	// 00000000000000000000000000000011
//	int b = 5;
//	// 00000000000000000000000000000101
//
//	int c = a ^ b;
//	// 00000000000000000000000000000110 - 结果为6
//
//	printf("%d\n", c);
//	return 0;
//}

//int main()
//{
//	int a = 10;  // 创建变量a，并且初始化为10
//	a = 20;  // 赋值（已经创建变量才叫赋值，上面叫初始化）
//
//	// 下面两种写法含义相同，得到的结果相同
//	a = a + 10;  // 赋值
//	a += 10;  // 复合赋值符
//	// 同理，其他复合赋值符用法也类似
//	return 0;
//}

//int main()  // ! - 逻辑反操作 - 可以让表达式条件真变为假，假变为真
//{
//	// C语言中，0为假，非0为真
//
//	int a = 10;
//	printf("%d\n", !a);  // 打印结果为0
//
//	int b = 0;
//	printf("%d\n", !b);  // 打印结果为1
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	if (a)  // a为真，要进入if语句
//	{
//
//	}
//
//	if (!a)  // a为假，进入if语句
//	{
//
//	}
//	return 0;
//}

//int main()  // +/-
//{
//	int a = 10;
//	int b = -a;  // 负值
//	int c = +a;  // 正值，一般省略掉
//	return 0;
//}

//int main()  // sizeof - 是操作符，不是函数，计算该类型所占内存空间的大小，单位是字节
//{
//	int a = 10;
//	printf("%d\n", sizeof(a));
//	printf("%d\n", sizeof(int));
//	return 0;
//}

// 整数在内存中存储的时候，存储的是二进制
// 一个整数的二进制有3种表示形式：原码、反码、补码
// 内存中存储整数的时候，存储的是二进制的补码，打印的是原码，计算时采用的也是补码

// 正整数：原码、反码、补码相同
// 负整数：原码、反码、补码是需要计算的
// 有符号的整数：最高位是0，表示正整数；最高位是1，表示负整数

// int a = 1;  // 4个字节 - 32bit
// 00000000000000000000000000000001 - 原码
// 00000000000000000000000000000001 - 反码
// 00000000000000000000000000000001 - 补码

// int a = -1;
// 10000000000000000000000000000001 - 原码
// 11111111111111111111111111111110 - 反码（原码的符号位不变，其他位按位取反，得到反码）
// 11111111111111111111111111111111 - 补码（反码的二进制序列+1就是补码）

//int main()  // ~ - 对一个数的二进制位按位取反
//{
//
//	int a = 0;  // 可以理解0为正数
//	// 00000000000000000000000000000000 - 0在内存中的补码
//
//	printf("%d\n", ~a);
//	// 11111111111111111111111111111111 - 补码按位取反，得到存储在计算机内的补码
//	// 11111111111111111111111111111110 - 反码
//	// 10000000000000000000000000000001 - 原码（-1）
//	return 0;
//}

//int main()  // 前置++/--
//{
//	int a = 2;
//	int c = --a;  // 先减减，后使用，a=1，c=1
//	printf("%d\n", a);  // 1
//	printf("%d\n", c);  // 1
//	return 0;
//}

//int main()  // 后置++/--
//{
//	int a = 2;
//	int c = a++;  // 先使用，后加加，a=3，c=2
//	printf("%d\n", a);  // 3
//	printf("%d\n", c);  // 2
//	return 0;
//}

//int main()  // lj代码
//{
//	int a = 1;
//	int b = (++a) + (++a) + (++a);
//	printf("b = %d\n", b);
//	return 0;
//}

//int main()  // lj代码
//{
//	int a = 10;
//	printf("%d %d\n", --a, --a);
//	return 0;
//}

//int main()  // () - 强制类型转换
//{
//	// int a = 3.14;  3.14默认双精度浮点数，赋值给int型变量会导致精度丢失,编译器会出现警告
//	int a = (int)3.14;   // 为了不让警告出现，可以采用强制类型转换
//	printf("%d\n", a);
//	return 0;
//}

//int main()  // && - 逻辑与 - 并且（两个条件都满足才可以）
//{
//	int a = 3;
//	int b = 5;
//
//	if ((a == 3) && (b == 4))  // 如果a==3并且b==4，打印哈哈
//	{
//		printf("哈哈\n");  // 有一个条件为假，不打印
//	}
//	return 0;
//}

//int main()  // || - 逻辑或 - 或者（有一个条件满足就可以）
//{
//	int a = 3;
//	int b = 5;
//
//	if ((a == 3) || (b == 4))  // 如果a==3或者b==4，打印呵呵
//	{
//		printf("呵呵\n");  // 有一个条件为真，打印呵呵
//	}
//	return 0;
//}

//int main()  // 逻辑运算符 - 三目运算符
//{
//	int a = 10;
//	int b = 0;
//	if (a == 5)
//	{
//		b = -6;
//	}
//	else
//	{
//		b = 6;
//	}
//	b = (a == 5 ? -6 : 6);
//	return 0;
//}

//int main()  // , - 逗号表达式
//{
//	int a = 0;
//	int b = 3;
//	int c = -1;
//
//	// 逗号表达式会从左向右依次计算
//	// 整个逗号表达式的结果是最后一个表达式的结果
//	int d = (a = b - 5, b = a + c, c = a + b, c -= 5);
//
//	// a=-2，b=-3，c=-10，最后表达式结果为-10赋值给d
//	printf("%d\n", d);
//	return 0;
//}

//int main()  // 下标引用操作符
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };  // 定义数组的[]不是操作符
//	// 数组下标范围为0~9
//	arr[9];  // 下标引用操作符，两个操作数arr和9
//	return 0;
//}

//int Add(int x, int y)
//{
//	return x + y;
//}
//
//int main()  // 函数调用操作符
//{
//	int ret = Add(3, 5);  // 函数调用操作符的操作数不确定，函数名+参数个数
//	printf("hehe\n");  // ()函数调用操作符
//	return 0;
//}

//int main()  // auto关键字
//{
//	int a = 10;  // 局部变量，进这个函数内自动创建，出这个函数自动销毁
//	// 局部变量 - 自动变量，本质上应该是auto int a = 10;，但是auto一般省略掉
//	return 0;
//}

//typedef unsigned int uint;  // 相当于起别名（小名）
//
//int main()  // typedef关键字 - 类型重定义
//{
//	unsigned int num1 = 100;  // 觉得unsigned int太长，创建变量麻烦，可以使用typedef重定义
//	uint num2 = 200;  // 这里的unit就等价于unsigned int
//	return 0;
//}

//int main()  // register关键字
//{
//	register int num = 100;  // 把num放在寄存器里
//
//	&num;  // 取地址是取内存的地址，而寄存器不是内存。既然num放在寄存器里，所以num是不能取地址的，error
//	return 0;
//}

//void test()  // 未用static修饰局部变量
//{
//	int a = 1;
//	a++;
//	printf("%d ", a);
//}
//
//int main()
//{
//	int i = 0;
//	while (i < 10)
//	{
//		test();
//		i++;
//	}
//	return 0;
//}

//void test()  // static修饰局部变量 - 改变了变量的生命周期，让静态局部变量出了作用域依然存在，到程序结束，生命周期才结束
//             // 但是作用域没有改变（不影响作用域），出了这个test函数依然不能使用a这个变量，比如在main函数使用a是不可能的
//{
//	static int a = 1;
//	a++;
//	printf("%d ", a);
//}
//
//int main()
//{
//	int i = 0;
//	while (i < 10)
//	{
//		test();
//		i++;
//	}
//	return 0;
//}

//extern int g_val;  // extern关键字 - 声明外部符号
//
//int main()  // 未用static修饰全局变量
//{
//	printf("%d\n", g_val);
//	return 0;
//}

//extern int g_val;  // extern关键字 - 声明外部符号
//
//int main()  // static修饰全局变量 - 被static修饰后，全局变量的外部链接属性变成了内部链接属性
//            // 全局变量只能在本源文件内部使用，其他源文件无法链接到，也无法使用
//{
//	printf("%d\n", g_val);
//	return 0;
//}

//extern int Add(int x, int y);  // extern关键字 - 声明外部符号
//
//int main()  // 未用static修饰函数
//{
//	int a = 10;
//	int b = 20;
//
//	int c = Add(a, b);
//	printf("%d\n", c);
//
//	return 0;
//}

//extern int Add(int x, int y);  // extern关键字 - 声明外部符号
//
//int main()  // static修饰函数 - 被static修饰后，函数的外部链接属性变成了内部链接属性
//            // 函数只能在本源文件内部使用，其他源文件无法链接到，也无法使用
//{
//	int a = 10;
//	int b = 20;
//
//	int c = Add(a, b);
//	printf("%d\n", c);
//
//	return 0;
//}

#define NUM 100
#define MAX(X,Y)  (X>Y?X:Y)

int main()  // #define定义常量和宏
{
	printf("%d\n", NUM);

	int a = 10;
	int b = 20;
	int c = MAX(a + 2, b);
	printf("%d\n", c);
	return 0;
}