#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>

//int main()
//{
//	// 对于/（除号）两边都是整数，执行的整数除法
//	int ret1 = 9 / 2;
//	printf("%d\n", ret1);
//	double ret2 = 9 / 2;
//	printf("%lf\n", ret2);
//
//	// 操作数中有浮点数，才执行浮点数除法
//	double ret3 = 9 / 2.0;
//	printf("%lf\n", ret3);
//
//	//%（取模）只能针对整型类型
//	int ret4 = 10 % 4;
//	printf("%d\n", ret4);
//
//	return 0;
//}

// 移位操作符，移动的是二进制位
// 对于整数的二进制有3中表示形式：原码、反码、补码
// 正整数 - 原码、反码、补码相同
// 负整数
// 原码 - 直接按照数字的正负写出的二进制序列
// 反码 - 原码的符号位不变，其他位按位取反得到的
// 补码 - 反码+1
// 整数在内存中存储的是二进制的补码

//int main()  // <<（左移操作符），左边丢弃，右边补0
//{
//	int a = 5;
//	int b = a << 1;
//	//int b = a + 1;  // 移位操作符不会修改a的值，类似于加法
//	printf("%d\n", a);
//
//	// 00000000000000000000000000000101 - 5
//	// 00000000000000000000000000001010 - 10
//	printf("%d\n", b);
//
//	int c = -1;
//	int d = c << 1;
//
//	// 10000000000000000000000000000001 - -1原码
//	// 11111111111111111111111111111110 - -1反码
//	// 11111111111111111111111111111111 - -1补码
//	// 11111111111111111111111111111110 - 补码
//	// 11111111111111111111111111111101 - 反码
//	// 10000000000000000000000000000010 - 原码-2
//	printf("%d\n", d);  // 打印的是原码的值
//
//	return 0;
//}

//int main()  // >>（右移操作符）1、逻辑右移：右边丢弃，左边补0  2、算术右移：右边丢弃，左边补原符号位（VS采用算术右移）
//{
//	int a = 5;
//	int b = a >> 1;
//
//	// 00000000000000000000000000000101 - 5
//	// 00000000000000000000000000000010 - 2
//	printf("%d\n", b);
//
//	int c = -1;
//	int d = c >> 1;
//
//	// 10000000000000000000000000000001 - -1原码
//	// 11111111111111111111111111111110 - -1反码
//	// 11111111111111111111111111111111 - -1补码
//	// 11111111111111111111111111111111 - 补码
//	// 11111111111111111111111111111110 - 反码
//	// 10000000000000000000000000000001 - 原码-1
//	printf("%d\n", d);
//
//	return 0;
//}

int main()
{
	int a = 15;
	int b = a >> -1;  // err - 标准未定义行为
	return 0;
}